"""Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
они сделали S журавликов. Сколько журавликов сделал каждый
ребенок, если известно, что Петя и Сережа сделали одинаковое
количество журавликов, а Катя сделала в два раза больше журавликов,
чем Петя и Сережа вместе?"""

number = int(input("Введите число корабликов которое делится на 6 - "))
print(f"Петя и Сережа сделали по {number//6} корабликов. Катя сделала {number//6*2*2} корабликов ")
